tests/NACA0012_IRK/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
4032
(
(0.08677917583602697 -0.04775384065838331 4.299936178698681e-06)
(0.07667810285250025 -0.0265255284245921 4.015415204687331e-06)
(0.07448250063662312 -0.04565115223783651 4.207278598110783e-06)
(0.1689075002684556 -0.07530594324509905 1.107512852365775e-05)
(0.07694390500971424 -0.01939504009476949 4.182143602573774e-06)
(0.1881029216395547 -0.0633742978899144 1.207280577104138e-05)
(0.04933552757499209 -0.02007073817332892 2.754302303411216e-06)
(0.124552288679757 -0.06359967106159328 8.815149521008985e-06)
...
)
;

boundaryField
{
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
    wing
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inout
    {
        type            inletOutlet;
        inletValue      uniform (0.9781476007338057 0.2079116908177593 0);
        value           nonuniform List<vector> 
126
(
(0.9839833475268389 0.2017407981457149 -9.22455180232425e-10)
(0.9566195292501799 0.1941214093741755 -1.130198215187953e-09)
(0.9663086771345172 0.187293135659394 2.265270196591677e-09)
(0.9751166615115298 0.1942026756856261 8.673405927540513e-10)
(0.9772958361260249 0.1938515566951402 -5.557761702771336e-10)
(0.9748095076986786 0.1956040430065892 -3.690259615693357e-10)
(0.9776281010781389 0.1962508995757805 -4.143380213355591e-10)
(0.9761378534648569 0.1972464249477089 -1.278121798102703e-10)
...
)
;
    }
}


// ************************************************************************* //
