tests/NACA0012_IRK/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<scalar> 
4032
(
-0.2794200852466407
-0.2676072667966997
-0.3383681302052741
-0.2815720017195523
-0.2559469644652504
-0.2744668482427025
-0.3460586555828095
-0.2985595811292927
...
)
;

boundaryField
{
    symmetry1
    {
        type            symmetry;
    }
    symmetry2
    {
        type            symmetry;
    }
    wing
    {
        type            zeroGradient;
    }
    inout
    {
        type            fixedValue;
        value           uniform 0;
    }
}


// ************************************************************************* //
